# Task 1

# n = int(input('Введите кол-во километров в день: '))
# m = int(input('Введите общий километраж: '))

# print((m + n - 1) // n)

# Отрицательное деление
# -7 // 2 = (-4) * 2 + 1
# -12 // 5 = (-3) * 5 + 3

# Task 2 

# n = int(input('Введите кол-во учеников в 1 классе: '))
# m = int(input('Введите кол-во учеников в 2 классе: '))
# b = int(input('Введите кол-во учеников в 3 классе: '))
# sum1 = n//2 + n % 2
# sum2 = m//2 + m % 2
# sum3 = b // 2 + b % 2
# print( sum1 + sum2 + sum3)

# task5
# i = int(input('Введите номер от головы поезда: '))

# j = int(input('Введите номер с хвоста поезда: '))

# if i == j:
#     print('Нужна доп информация')
# else:
#     print(i + j - 1)

#Task 7
# i = int(input('Введите номер года: '))
# if i % 4 == 0 and not(i%100==0):
#     print('Это высокостный год')
# elif i%400==0:
#     print('Высокостный')
# else:
#     print('Нет')
